<?php

$lang['required'] 			= "Поле %s  является обязательным.";
$lang['isset']				= "Поле %s  должно иметь значение.";
$lang['valid_email']		= "Поле %s  должно содержать правильный email адрес.";
$lang['valid_emails'] 		= "Поле %s  должно содержать все правильные email адреса.";
$lang['valid_url'] 			= "Поле %s  должно содержать правильный URL.";
$lang['valid_ip'] 			= "Поле %s  должно содержать правильный IP.";
$lang['min_length']			= "Поле %s  должно быть не менее %s символов в длину.";
$lang['max_length']			= "Поле %s  не может превышать %s символов в длину";
$lang['exact_length']		= "Поле %s  должно быть точно %s символов в длину";
$lang['alpha']				= "Поле %s  может содержать только буквы алфавита.";
$lang['alpha_numeric']		= "Поле %s  может содержать только буквенно-цифровые символы.";
$lang['alpha_dash']			= "Поле %s  может содержать только буквенно-цифровые символы, подчеркивания и тире";
$lang['numeric']			= "Поле %s  должно содержать только цифры.";
$lang['is_numeric']			= "Поле %s  должно содержать только цифры.";
$lang['integer']			= "Поле %s  должно содержать целое число.";
$lang['regex_match']		= "Поле %s  не в правильном формате.";
$lang['matches']			= "Поле %s  не соответствует полю %s.";
$lang['is_natural']			= "Поле %s  должно содержать только положительные числа.";
$lang['is_natural_no_zero']	= "Поле %s  должно содержать число, больше нуля.";
$lang['decimal']			= "Поле %s  должно содержать десятичное число.";
$lang['less_than']			= "Поле %s  должно содержать число, которое меньше %s.";
$lang['greater_than']		= "Поле %s  должно содержать число, большее %s.";


/* End of file form_validation_lang.php */
/* Location: ./system/language/english/form_validation_lang.php */