<?php

$lang['imglib_source_image_required'] 		= "Вы должны указать источник изображения в ваших параметрах.";
$lang['imglib_gd_required'] 				= "Для этой функции требуется библиотека GD.";
$lang['imglib_gd_required_for_props'] 		= "Ваш сервер должен поддерживать библиотеку GD для определения свойств изображения.";
$lang['imglib_unsupported_imagecreate'] 	= "Ваш сервер не поддерживает функцию GD, необходимую для обработки этого типа изображения.";
$lang['imglib_gif_not_supported'] 			= "GIF изображения часто не поддерживаются из-за лицензионных ограничений. Возможно, вам придется вместо этого использовать JPG или PNG изображений.";
$lang['imglib_jpg_not_supported'] 			= "JPG изображения не поддерживаются.";
$lang['imglib_png_not_supported'] 			= "PNG изображения не поддерживаются.";
$lang['imglib_jpg_or_png_required'] 		= "Протокол изменения размера изображения , указанный в настройках работает только с JPEG или PNG типами изображений.";
$lang['imglib_copy_error'] 					= "Произошла ошибка при попытке заменить файл. Пожалуйста, убедитесь, что файл каталог доступен для записи.";
$lang['imglib_rotate_unsupported'] 			= "Поворот изображения, кажется, не поддерживается вашим сервером.";
$lang['imglib_libpath_invalid'] 			= "Путь к вашей Библиотеке изображений не является правильным. Пожалуйста, установите правильный путь в настройках.";
$lang['imglib_image_process_failed'] 		= "Обработка изображений не удалось. Пожалуйста, убедитесь что ваш сервер поддерживает выбранный протокол , и что путь к вашей Библиотеке изображений является правильным.";
$lang['imglib_rotation_angle_required'] 	= "Требуется указать Угол поворота для поворота изображения.";
$lang['imglib_writing_failed_gif'] 			= "GIF изображение.";
$lang['imglib_invalid_path'] 				= "Неправильный путь к изображению, .";
$lang['imglib_copy_failed'] 				= "Процедура копирования изображений не удалась.";
$lang['imglib_missing_font'] 				= "Не удалось найти шрифт.";
$lang['imglib_save_failed'] 				= "Невозможно сохранить изображение. Пожалуйста, убедитесь что каталог файлов и картинок  доступны для записи.";


/* End of file imglib_lang.php */
/* Location: ./system/language/english/imglib_lang.php */